Repository: pypi-data/pypi-mirror-335
Catalog: packages/pyams-portal/pyams_portal-2.6.0-py3-none-any.whl/pyams_portal/locales/*/LC_MESSAGES/pyams_portal.po
Languages: fr

source: Manage presentation templates
fr: Gérer les modèles de présentation

source: Designer (role)
fr: Designer (rôle)

source: Portlet
fr: Composant

source: Slot name
fr: Nom du bloc

source: Slot name to which this configuration applies
fr: Nom du bloc à l'intérieur duquel le composant sera ajouté

source: Portlet renderer
fr: Mode de rendu

source: Name of renderer used to render this portlet
fr: Nom du mode de rendu utilisé pour restituer le contenu de ce composant

source: Devices visibility
fr: Périphériques d'affichage

source: You can specify devices on which this portlet will be displayed or not
fr: Utilisez cette option pour limiter l'affichage du composant à certains types de périphériques

source: Custom CSS class
fr: Classe CSS

source: This CSS class will be added to base portlet CSS classes
fr: Cette classe CSS sera appliquée comme classe supplémentaire sur ce composant

source: Inherit parent configuration?
fr: Hériter de la configuration du parent

source: This option is only available if context's parent is using the same template...
fr: Cette option n'est applicable que si le niveau parent utilise le même modèle de présentation...

source: Override parent configuration?
fr: Redéfinir les propriétés du composant

source: Portlet renderer thumbnail
fr: Vignette du mode de rendu

source: This image will be displayed into portlet renderer selection list
fr: Cette image sera affichée dans la liste de sélection des portlets

source: Renderers thumbnails selection
fr: Sélection des vignettes

source: This property contains thumbnails of all available portlets renderers
fr: Vous pouvez associer une vignette à chaque mode de rendu

source: Renderer name
fr: Nom du mode de rendu

source: This name must be unique in a given template
fr: Ce nom doit un être unique au sein d'un modèle de présentation

source: Row ID
fr: ID de la ligne

source: Visible slot?
fr: Bloc visible ?

source: Select 'no' to hide this slot...
fr: Sélectionner 'non' pour cacher ce bloc...

source: Container CSS class
fr: Classe CSS du conteneur

source: CSS class applied to this slot container
fr: Classe CSS spécifique appliquée au conteneur de ce bloc ; dans le cas où aucune classe CSS n'est indiquée, ce conteneur n'est pas créé

source: Extra small device width
fr: Largeur sur très petits périphériques

source: Slot width, in columns count, on extra small devices (&lt; 576 pixels); set to 0 to hide the slot
fr: Largeur du bloc, en nombre de colonnes, sur les très petits périphériques (&lt; 576 pixels) ; indiquez une valeur de 0 pour ne pas afficher ce bloc sur ce type de périphérique...

source: Small device width
fr: Largeur sur petits périphériques

source: Slot width, in columns count, on small devices (&gt;= 576 pixels); set to 0 to hide the slot
fr: Largeur du bloc, en nombre de colonnes, sur les petits périphériques (&gt;= 576 pixels) ; indiquez une valeur de 0 pour ne pas afficher ce bloc sur ce type de périphérique...

source: Medium devices width
fr: Largeur sur périphériques moyens

source: Slot width, in columns count, on medium desktop devices (&gt;= 768 pixels); set to 0 to hide the slot
fr: Largeur du bloc, en nombre de colonnes, sur les périphériques moyens (&gt;= 768 pixels) ; indiquez une valeur de 0 pour ne pas afficher ce bloc sur ce type de périphérique...

source: Large devices width
fr: Largeur sur grands périphériques

source: Slot width, in columns count, on large desktop devices (&gt;= 992 pixels); set to 0 to hide the slot
fr: Largeur du bloc, en nombre de colonnes, sur les grands périphériques (&gt;= 992 pixels) ; indiquez une valeur de 0 pour ne pas afficher ce bloc sur ce type de périphérique...

source: Extra-large devices width
fr: Largeur sur très grands périphériques

source: Slot width, in columns count, on extra large desktop devices (&gt;= 1200 pixels); set to 0 to hide the slot
fr: Largeur du bloc, en nombre de colonnes, sur les très grands périphériques (&gt;= 1200 pixels) ; indiquez une valeur de 0 pour ne pas afficher ce bloc sur ce type de périphérique...

source: CSS class
fr: Classe CSS

source: CSS class applied to this slot
fr: Classe CSS spécifique appliquée à ce bloc

source: Portlets CSS class
fr: Classe CSS du conteneur des composants

source: CSS class applied to the inner portlets container
fr: Classe CSS spécifique appliquée au conteneur intermédiaire des composants

source: HTML prefix
fr: Préfixe HTML

source: This HTML code with be included, as is, before the first portlet
fr: Ce code HTML sera intégré dans la page, en l'état, juste avant le premier composant

source: HTML suffix
fr: Suffixe HTML

source: This HTML code will be included, as is, after the last portlet
fr: Ce code HTML sera intégré dans la page, en l'état, juste après le dernier composant

source: Template name
fr: Nom du modèle

source: Explicit name given to portal template
fr: Nom explicite du modèle de présentation

source: This CSS class will be used as main template container CSS class
fr: Cette classe CSS sera appliquée comme classe principale du conteneur du modèle de présentation, lors du rendu en front-office

source: Access menu from home
fr: Ajouter un accès depuis l'accueil

source: If 'yes', a menu will be displayed to get access to portal templates container from site admin home page
fr: Si 'oui', un menu d'accès au gestionnaire de modèles de présentation sera ajouté depuis la page d'accueil de l'interface d'administration du site

source: List of designers allowed to manage presentation templates
fr: Liste des mandataires hbailités à gérer les modèles de présentation

source: Toolbar portlets
fr: Composants de la barre d'outils

source: These portlets will be directly available in templates configuration page toolbar
fr: Les composants sélectionnés seront accessibles directement dans la barre d'outils du module de mise en page des modèles de présentation

source: Inherit parent template?
fr: Hériter du modèle du parent ?

source: Should we reuse parent template?
fr: Si 'oui', le même modèle que le niveau parent sera utilisé

source: Override parent template?
fr: Redéfinir le modèle de présentation

source: Should we override parent template?
fr: Si 'oui', le modèle du niveau parent ne sera pas utilisé

source: Use local template?
fr: Utiliser un modèle spécifique

source: If 'yes', you can define a custom local template instead of a shared template
fr: Si 'oui', vous pouvez choisir d'utiliser un modèle de présentation propre à ce contexte plutôt qu'un modèle de présentation partagé

source: Local template
fr: Modèle de présentation spécifique

source: Use shared template?
fr: Utiliser un modèle partagé

source: If 'yes', you can select a shared template
fr: Si 'oui', vous pouvez sélectionner un modèle de présentation partagé pour prendre en charge la présentation de ce contexte

source: Page template
fr: Modèle de présentation

source: Template used for this page
fr: Modèle de présentation utilisé pour ce contexte

source: Portal template: {}
fr: Modèle de présentation : {}

source: Presentation
fr: Présentation

source: Page template configuration
fr: Choix du modèle de présentation

source: Header presentation
fr: En-tête de page

source: Page header template configuration
fr: Modèle de présentation de l'en-tête de page

source: Footer presentation
fr: Pied de page

source: Page footer template configuration
fr: Modèle de présentation du pied de page

source: You must choose between using a shared template or a local template if you don't inherit from parent template!
fr: Vous devez choisir un modèle partagé ou un modèle spécifique si vous n'héritez pas du modèle de présentation du parent !

source: You must select a template when setting shared template mode!
fr: Vous devez choisir un modèle lorsque vous souhaitez utiliser un modèle partagé !

source: No selected template
fr: Pas de modèle sélectionné

source: Please select template...
fr: Veuillez choisir un modèle de présentation...

source: If you select a shared template or choose to inherit from parent configuration, you can adjust settings of each portlet but can't change page configuration. If you choose to use a local template, it's configuration will only be reusable in sub-levels which will choose to inherit from it.
fr: Si vous choisissez d'utiliser un modèle de présentation partagé ou d'hériter de la configuration du niveau parent, vous pourrez ajuster les paramètres de chaque composant mais vous ne pourrez pas modifier la configuration de la page. Si vous choisissez d'utiliser un modèle de présentation spécifique, vous aurez toute liberté pour paramétrer ce modèle, mais il ne sera réutilisable que dans les sous-niveaux qui choisiront d'en hériter.

source: Page layout
fr: Mise en page

source: Header layout
fr: Mise en page

source: Footer layout
fr: Mise en page

source: Portal template
fr: Modèle de présentation

source: Local template configuration
fr: Mise en page d'un modèle de présentation spécifique

source: Inherited local template configuration
fr: Mise en page du modèle de présentation (hérité du parent)

source: « {} » shared template configuration
fr: Mise en page du modèle de présentation « {} »

source: « {} » template configuration
fr: Mise en page du modèle de présentation

source: Add component: {0}<br />Drag and drop button to page template to position new row
fr: Ajouter un composant : <strong>{0}</strong><br />Faire un glisser/déposer du bouton dans le modèle de présentation pour positionner ce nouveau composant au sein d'un bloc.

source: {{ missing portlet }}
fr: {{ composant introuvable }}

source: Share template
fr: Partager le modèle

source: Close
fr: Fermer

source: Share local template
fr: Partager le modèle de présentation

source: Share local header template
fr: Partager le modèle de présentation de l'en-tête de page

source: Share local footer template
fr: Partager le modèle de présentation du pied de page

source: Sharing a local template will make a copy of it in shared templates utility. Your page will then be configured to use this template, but your previous local template will not be lost...
fr: Une copie de ce modèle de présentation spécifique va être créée et ajoutée aux modèles de présentation partagés. Votre mode de présentation sera ensuite configuré pour utiliser ce modèle partagé, mais la configuration de votre modèle de présentation spécifique sera conservée et pourra être réutilisée si vous souhaitez y revenir...

source: Portlet: {}
fr: Composant : {}

source: Shared template: {}
fr: Modèle partagé : {}

source: {} (inherited from parent)
fr: {} (hérité du parent)

source: New portlet
fr: Nouveau composant

source: New portlet properties
fr: Propriétés du nouveau composant

source: Portlet properties
fr: Propriétés du composant

source: WARNING: portlet configuration is saved immediately when inherit mode is changed!!
fr: ATTENTION : la configuration du composant est enregistrée immédiatement lorsque vous modifiez le mode d'héritage !

source: Portlet settings
fr: Propriétés du composant

source: Data successfully updated.
fr: Les modifications ont été enregistrées.

source: No changes were applied.
fr: Aucune modification n'a été effectuée.

source: You changed selected portlet renderer. Don't omit to check new renderer settings...
fr: Vous avez changé le mode de rendu de ce composant ; n'oubliez pas de vérifier les paramètres du nouveau mode de rendu !

source: Renderer: {}
fr: Mode de rendu : {}

source: Renderer settings
fr: Propriétés du mode de rendu

source: Portal templates
fr: Modèles de présentation

source: Templates list
fr: Liste des modèles

source: List of portal templates
fr: Liste des modèles de présentation

source: Portlets configuration
fr: Configuration des composants

source: Template selected portlets
fr: Composants proposés

source: Management interface
fr: Interface d'administration

source: No selected renderer (use default)
fr: Pas de mode de rendu sélectionné (utiliser le mode par défaut)

source: Renderers thumbnails
fr: Modes de rendu

source: Portlets renderers thumbnails
fr: Vignettes associées aux modes de rendu

source: Thumbnails of portlets renderers
fr: Vignettes des modes de rendu

source: New slot
fr: Nouveau bloc

source: New slot properties
fr: Propriétés du nouveau bloc

source: Specified name is already used!
fr: Le nom indiqué est déjà utilisé !

source: Row ID must be an integer value!
fr: Le numéro de ligne doit être un nombre entier !

source: Row ID must be between 1 and {0}!
fr: Le numéro de ligne doit être compris entre 1 et {} !

source: Slot: {}
fr: Bloc : {}

source: Slot properties
fr: Propriétés du bloc

source: HTML codes
fr: Codes HTML

source: Add template
fr: Ajouter un modèle de présentation

source: New template
fr: Nouveau modèle de présentation

source: New template properties
fr: Propriétés du nouveau modèle

source: {} --- Local template
fr: {} --- Modèle de présentation spécifique

source: Template: {}
fr: Modèle de présentation : {}

source: Clone template
fr: Dupliquer ce modèle

source: Template clone
fr: Duplication du modèle

source: New template clone properties
fr: Propriétés du nouveau modèle

source: Properties
fr: Propriétés

source: Template configuration
fr: Propriétés du modèle de présentation

source: Template properties
fr: Propriétés du modèle

source: Renderer:
fr: Mode de rendu :

source: !! MISSING RENDERER !!
fr: !! INCONNU !!

source: (missing value: {})
fr: {{ composant introuvable }}

source: Set renderer settings
fr: Propriétés du mode de rendu

source: Browse...
fr: Parcourir...

source: Current value:
fr: Sélection actuelle :

source: Delete
fr: Supprimer

source: Hidden element
fr: Élément non affiché

source: Use shared template
fr: Utiliser un modèle de présentation partagé

source: Use local template
fr: Utiliser un modèle de présentation spécifique

source: Add row<br />Drag and drop button to page template to position new row, or just click to add new row at the end
fr: Ajouter une ligne<br />Faire un glisser/déposer du bouton dans le modèle de présentation pour positionner cette ligne au sein du modèle, ou cliquer simplement sur le bouton pour ajouter une ligne en-dessous des autres

source: Add slot<br />Drag and drop button to page template to position new slot, or just click to display add form
fr: Ajouter un bloc<br />Faire un glisser/déposer du bouton dans le modèle de présentation pour positionner ce bloc au sein d'une ligne, ou cliquer simplement sur le bouton pour accéder au formulaire de création

source: Add another portlet...
fr: Ajouter un autre composant...

source: Selected display:
fr: Périphérique sélectionné :

source: Extra small device (phone, &lt; 576px)
fr: Très petit périphérique (téléphone, &lt; 576px)

source: Small device (tablet, &gt;= 576px)
fr: Petit périphérique (tablette, &gt;= 576px)

source: Medium desktop device (&gt;= 768px)
fr: Périphérique moyen (&gt;= 768px)

source: Large desktop device (&gt;= 992px)
fr: Grand périphérique (&gt;= 992px)

source: Extra-large device (&gt;= 1200px)
fr: Très grand périphérique (&gt;= 1200px)

source: Delete row...
fr: Supprimer la ligne...

source: Show/hide slot
fr: Afficher/masquer le bloc

source: This slot is not visible
fr: Ce bloc n'est pas affiché

source: Edit slot properties
fr: Propriétés du bloc

source: Delete slot
fr: Supprimer le bloc

source: This portlet is hidden
fr: Ce composant n'est pas affiché

source: Edit portlet properties
fr: Propriétés du composant

source: Portlet settings are not those of original template
fr: Les propriétés du composant sont différentes de celles du modèle de présentation

source: Delete portlet
fr: Supprimer le composant

source: Visible card?
fr: Carte visible ?

source: Card's title
fr: Titre de la carte

source: Card's illustration
fr: Image d'illustration de la carte

source: Body
fr: Contenu

source: Main card's text
fr: Contenu de la carte

source: Button internal target
fr: Lien interne

source: Optional button reference target
fr: Référence interne de la destination du bouton d'action ; vous pouvez rechercher les contenus par leur titre, ou en indiquant le caractère "+" suivi de leur numéro interne

source: Button external URI
fr: Lien externe

source: Alternate URI target used for optional button
fr: URL externe de la destination du bouton d'action

source: You can only set an internal target OR an external URL...
fr: Vous ne pouvez définir qu'un lien interne OU un lien externe...

source: Button label
fr: Libellé du bouton

source: Optional button label
fr: Libellé du bouton d'action

source: Button status
fr: Statut du bouton

source: Status of optional button
fr: Statut correspondant à la couleur du bouton

source: Card's CSS class
fr: Classe CSS

source: Title
fr: Titre

source: Main component title
fr: Titre principal du composant

source: Leading text
fr: En-tête

source: Short text to be displayed below title
fr: Texte court affiché en-dessous du titre

source: Bootstrap: cards
fr: Bootstrap: cartes

source: Click icon to show or hide card
fr: Cliquer pour afficher ou masquer la carte

source: Target
fr: Cible

source: List of portlet cards
fr: Liste des cartes

source: Add card
fr: Ajouter une carte

source: New card
fr: Nouvelle carte

source: New card properties
fr: Propriétés de la nouvelle carte

source: Card: {}
fr: Carte : {}

source: Card properties
fr: Propriétés de la carte

source: Action button
fr: Bouton d'action

source: Cards list:
fr: Liste des cartes :

source: Cards container CSS class
fr: Classe CSS du conteneur des cartes

source: Images selection
fr: Sélection des images

source: Cards will use responsive selections by default, but you can also force selection of another specific selection
fr: Les cartes utilisent les sélections responsives par défaut, mais vous pouvez choisir de forcer l'utilisation d'une sélection spécifique

source: Bootstrap cards renderer (default)
fr: Cartes Bootstrap (par défaut)

source: Bootstrap cards Masonry renderer
fr: Cartes Bootstrap avec rendu Masonry

source: Selected image
fr: Image sélectionnée

source: Image renderer (default)
fr: Image responsive (par défaut)

source: Transparent spacer?
fr: Fond transparent

source: If 'no', spacer background will be defined by selected color
fr: Si 'non', la couleur de fond sera définie par la couleur sélectionnée ci-dessous

source: Background color
fr: Couleur de fond

source: Color selected for background, if transparency is disabled
fr: Couleur de fond sélectionnée, lorsque la transparence est désactivée

source: Horizontal ruler?
fr: Filet horizontal

source: If 'yes', an horizontal ruler will be displayed in the middle of the spacer
fr: Si 'oui', un filet horizontal est affiché au centre de l'espacement

source: Spacer
fr: Espacement

source: Simple spacer (default)
fr: Espacement simple (par défaut)

source: Double spacer
fr: Espacement double

source: Thin spacer
fr: Espacement fin

source: Visible item?
fr: Élément visible ?

source: Image title
fr: Titre de l'image

source: Show text to be displayed below title
fr: Texte court affiché en-dessous du titre

source: Carousel image illustration
fr: Image d'illustration

source: Image interval
fr: Intervalle

source: Image slide duration, in seconds
fr: Durée d'affichage de l'image, en secondes, lorsque le balayage automatique est activé

source: Lead
fr: En-tête

source: List of carousel items
fr: Liste des images du carousel

source: Add image
fr: Ajouter une image

source: New image
fr: Nouvelle image

source: New image properties
fr: Propriétés de la nouvelle image

source: Carousel image properties
fr: Propriétés de l'image

source: Items list:
fr: Liste des images :

source: Carousel container CSS class
fr: Classe CSS du carousel

source: Carousel can use responsive selections, but you can also force selection of another specific selection
fr: Le carousel utilise les sélections responsives par défaut, mais vous pouvez choisir de forcer l'utilisation d'une sélection spécifique

source: Automatic sliding
fr: Balayage automatique

source: If 'no', sliding will only be activated manually
fr: Si 'non', le balayage ne sera activé que manuellement ; n'oubliez pas d'activer les contrôles dans ce cas !!

source: Fade effect
fr: Effet de fondu

source: If 'yes', slide to slide animation will use a fade effect instead of lateral sliding
fr: Si 'oui', le carousel utilisera un effet de fondu lors du passage d'une diapositive à la suivante plutôt qu'un effet de glissé latéral

source: Display controls
fr: Afficher les contrôles

source: If 'yes', display arrows to navigate between slides
fr: Si 'oui', des flèches de navigation sont affichées pour changer de diapositive

source: Display indicators
fr: Afficher les indicateurs

source: If 'yes', display indicators to show position of current slide
fr: Si 'oui', des indicateurs sont affichés pour visualiser la position de la diapositive active au sein du carousel

source: Display captions
fr: Afficher les titres

source: If 'no', slides titles and leads are not displayed
fr: Si 'non', les titres et les en-têtes des diapositives ne sont pas affichés

source: Enable swiping
fr: Autoriser les mouvements de balayage

source: If 'no', touch events will be disabled on touchscreens
fr: Si 'non', les mouvements de balayage seront désactivés sur les écrans tactiles

source: Bootstrap carousel renderer (default)
fr: Carousel Bootstrap (par défaut)

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Display ruler
fr: Filet horizontal

source: If 'yes', an horizontal line will be displayed between leading text and body
fr: Si 'oui', un filet horizontal est affiché entre le texte d'en-tête et le contenu

source: Main text
fr: Texte principal

source: Bootstrap Jumbotron renderer (default)
fr: Jumbotron Bootstrap (par défaut)

source: Source code
fr: Code source

source: This code will be used 'as is', without any transformation, if using the 'raw' renderer. Use with care!!<br />You can enter &lt;CTRL&gt;+&lt;,&gt; to display text editor options...
fr: Ce code sera utilisé tel quel, sans aucune transformation. À utiliser donc avec précaution !<br />Vous pouvez utiliser le raccourci clavier &lt;CTRL&gt;+&lt;,&gt; pour afficher les options de l'éditeur de texte...

source: Rich text
fr: Texte enrichi

source: Title:
fr: Titre :

source: Alert status
fr: Statut de l'alerte

source: Bootstrap alert status defines alert rendering color
fr: Le statut de l'alerte détermine la couleur utilisée pour le rendu de l'alerte

source: Display dismiss button
fr: Afficher le bouton de masquage

source: Select this option to display a dismiss button
fr: Cette option permet d'afficher un bouton permettant de masquer l'alerte temporairement

source: HTML source code (default)
fr: Code source HTML (par défaut)

source: Formatted source code
fr: Code source formatté

source: ReStructured text
fr: Texte restructuré

source: Markdown text
fr: Markdown

source: Rich text (default)
fr: Texte enrichi (par défaut)

source: Bootstrap alert
fr: Bootstrap: alerte

source: Hidden portlet
fr: NON affiché
