Repository: pypi-data/pypi-mirror-335
Catalog: packages/ChamberCourt/chambercourt-0.9.26.tar.gz/chambercourt-0.9.26/po/*.po
Languages: ro, sr, sv, uk

source: cannot find asset `{}'
ro: nu se poate găsi fișierul „{}”
sr: не могу да нађем „{}“
sv: kan inte hitta resurs `{}'
uk: не вдалося знайти ресурс «{}»

source: Start level: {}/{}
ro: Nivelul de pornire: {}/{}
sr: Започни ниво: {}/{}
sv: Startnivå: {}/{}
uk: Початковий рівень: {}/{}

source: Level {}:
ro: Nivel {}:
sr: Ниво {}:
sv: Nivå {}:
uk: Рівень {}:

source: a directory or Zip file of levels to use
ro: un director sau un fișier Zip cu nivelurile de utilizat
sr: директоријум или Зип датотека нивоа за коришћење
sv: en katalog eller zip-fil med nivåer att använda
uk: каталог або файл Zip рівнів, яким слід скористатися

source: %(prog)s {} by {}
ro: %(prog)s {} de {}
sr: %(prog)s {} је написао {}
sv: %(prog)s {} av {}
uk: %(prog)s {} від {}

source: Error reading levels: {}
ro: Eroare la citirea nivelurilor: {}
sr: Грешка читања нивоа: {}
sv: Fel vid läsning av nivåer: {}
uk: Помилка під час читання рівнів: {}

source: Could not find any levels
ro: Nu s-a putut găsi niciun nivel
sr: Не могу да нађем ни један ниво
sv: Kunde inte hitta några nivåer
uk: Не вдалося знайти жодного рівня

source: Z/X - Left/Right '/? - Up/Down or use the arrow keys to move
ro: Z/X - Stânga/dreapta '/? - Sus/jos sau utilizează tastele săgeată pentru a te deplasa
sr: Z/X – Лево/десно '/? – Горе/доле или користите тастере стрелица за кретање
sv: Z/X - Vänster/Höger '/? - Upp/Ner eller piltangenterna för att röra dig
uk: Z/X - ліворуч/праворуч '/? - вгору/вниз or use the arrow keys to move

source: S/L - Save/load position R - Restart level Q - Quit game F - toggle full screen
ro: S/L - Salvare/încărcare poziție R - Reîncepe nivelul Q - Ieși din joc F - comutare ecran complet
sr: S/L – Чува/учитава положај R – Поново покреће ниво Q – Завршава игру F – Окида приказ преко целог екрана
sv: S/L - Spara/läs in position R - Starta om nivå Q - Avsluta spel F - växla helskärmsläge
uk: S/L - зберегти/завантажити позицію R - перезапустити рівень Q - вийти з гри F - увімкнути або вимкнути повноекранний режим

source: (choose with movement keys and digits)
ro: (alegeți cu tastele de deplasare și cifrele)
sr: (изаберите тастерима кретања и цифрама)
sv: (välj med rörelsetangenter och siffror)
uk: (виберіть клавіші пересування та цифри)

source: Press the space bar to play!
ro: Apasă bara de spațiu pentru a juca!
sr: Притисните тастер размака да започнете игру!
sv: Tryck mellanslag för att spela!
uk: Натисніть пробіл, щоб почати гру!
