Repository: pypi-data/pypi-mirror-335
Catalog: packages/lino-avanti/lino_avanti-25.3.1-py3-none-any.whl/lino_avanti/lib/avanti/locale/*/LC_MESSAGES/django.po
Languages: de

source: Translator type
de: Übersetzerart

source: Private
de: Privat

source: Starting reason
de: Einschreibegrund

source: Voluntarily
de: Freiwillig

source: Mandatory
de: Verpflichtet

source: Successfully ended
de: Erfolgreich beendet

source: Health problems
de: Gesundheitsprobleme

source: Familiar reasons
de: Familiäre Gründe

source: Missing motivation
de: Fehlende Motivation

source: Return to home country
de: Rückkehr ins Geburtsland

source: Professional situation
de: Berufliche Situation

source: Workless
de: Arbeitslos

source: Seeking
de: Eingeschrieben beim Arbeitsamt

source: Employed
de: Angestellt

source: Independent
de: Selbstständig

source: Retired
de: Pensioniert

source: Unemployable
de: Arbeitsunfähig

source: Residence state
de: Aufenthaltsstatus

source: Residence states
de: Aufenthaltsstatuus

source: Temporary
de: Befristet

source: Permanent
de: Unbefristet

source: Uncertain
de: Unsicher

source: Without
de: Ohne

source: Whether this pupil has small children to care about.
de: Ob dieser Teilnehmer Kleinkinder zu betreuen hat.

source: List of enrolments with high absence rate for review by their coach.
de: Liste der Einschreibungen mit hoher Abwesenheitsrate zwecks Kontrolle durch den Begleiter.

source: Contact language
de: Kontaktsprache

source: Ending reason
de: Beendigungsgrund

source: Ending reasons
de: Beendigungsgründe

source: Residence permit
de: Aufenthaltstitel

source: Residence permits
de: Aufenthaltstitel

source: Residence reason
de: Aufenthaltsgrund

source: Residence reasons
de: Aufenthaltsgründe

source: Client
de: Klient

source: Clients
de: Klienten

source: Lives in Belgium since
de: Lebt in Belgien seit

source: Lives in region since
de: Lebt in der DG seit

source: Translator
de: Übersetzer

source: Unemployed since
de: Arbeitslos seit

source: Seeking work since
de: Sucht Arbeit seit

source: Needs work permit
de: Braucht Arb.Erl.

source: suspended until
de: Wartezeit bis

source: Has contact to PCSW
de: Kunde beim ÖSHZ

source: Has contact to work office
de: Eingetragen beim ADG

source: Declared name
de: Deklarierter Name

source: Unavailable until
de: Nicht verfügbar bis

source: Family situation
de: Familiäre Situation

source: Residential situation
de: Wohnsituation

source: Health situation
de: Gesundheitliche Situation

source: Financial situation
de: Finanzielle Situation

source: Integration notes
de: Soziale Situation

source: Availability
de: Verfügbarkeit

source: Needed course
de: Kursbedarf

source: Language notes
de: Bericht Sprachtests

source: Reason of stay
de: Aufenthaltsgrund

source: Nationality
de: Staatsangehörigkeit

source: ({}) from {}
de: ({}) aus {}

source: Primary coach
de: Primärbegleiter

source: Legacy file number
de: Dossiernummer

source: General
de: Allgemein

source: Residence
de: Wohnsitz

source: Courses
de: Kurse

source: Family
de: Familie

source: Trends
de: Entwicklungsschritte

source: Miscellaneous
de: Sonstiges

source: Career
de: Lebenslauf

source: Residences
de: Wohnsitze

source: Former residences
de: Frühere Wohnsitze

source: Incoming
de: Empfangsbestätigung

source: Informed
de: Informiert

source: Newcomer
de: Neuantrag

# client state
source: Equal
de: Gleichgestellt

# client state
source: Registered
de: Eingeschrieben

source: Ended
de: Beendet

source: Abandoned
de: Abgebrochen

source: New {}
de: {} erstellen

source: Anonymous
de: Anonym

source: Teacher
de: Kursleiter

source: Social worker
de: Sozialarbeiter

source: Coordinator
de: Koordinator

source: Secretary
de: Sekretär

source: Administrator
de: Verwalter

source: Health insurance
de: Krankenkasse

source: School
de: Schule

source: Pharmacy
de: Apotheke

source: Public Center for Social Welfare
de: ÖSHZ

source: Work consultant
de: Arbeitsberater

source: Language course
de: Sprachkurs

source: Integration course
de: Integrationskurs

source: Justified interruption
de: Begründete Unterbrechung

source: Successfully terminated
de: Erfolgreich beendet

source: Final report
de: Abschlussbericht

source: Integration assistant
de: DSBE

source: Absence reason
de: Abwesenheitsgrund

source: Absence reasons
de: Abwesenheitsgründe

source: Sickness
de: Krankheit

source: Other valid reason
de: Sonstiger gültiger Grund

source: Unknown
de: Unbekannt

source: Unjustified
de: Unberechtigt

source: Address
de: Adresse

source: More
de: Mehr

source: Reminder states
de: Abmahnungszustände

source: Draft
de: Entwurf

source: Sent
de: Verschickt

source: Final
de: Endgültig

source: Degree
de: Mahnungsgrad

source: Reminder degrees
de: Mahnungsgrade

source: First reminder
de: Erste Abmahnung

source: Second reminder
de: Zweite Abmahnung

source: Third reminder
de: Dritte Abmahnung

source: Allow excuses
de: Entschuldigungen zulassen

source: Childcare
de: Kinderbetreuung

source: Evening
de: Abend

source: Update missing rates
de: Abwesenheitsraten aktualisieren

source: Missing rate
de: Abwesenheitsrate

source: Integration Course Agreement
de: Vereinbarung Integrationsparcours

source: Update missing rate
de: Abwesenheitsrate aktualisieren

source: Reminder
de: Abmahnung

source: Reminders
de: Abmahnungen

source: Situation on
de: Situation am

source: Text body
de: Textkörper

source: Remark
de: Bemerkung

source: Absence control
de: Abwesenheitskontrolle

source: Course planning
de: Kursplanung

source: Foreign education level
de: Akademischer Grad Ausland

source: Recognized in Belgium
de: In Belgien anerkannt

source: Work area
de: Arbeitsbereich

source: Solution
de: Lösung

source: Coaching
de: Begleitung
